INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-06-03 15:11:00', '1', 'ACCEPTED', '2', '3', '88', 'MySQL и MongoDB — когда и что лучше использовать?',
        'MySql и MongoDB — мощные СУБД, которые имеют множество функций для выполнения большинства задач.
        И обе системы используют одну и ту же базу данных, но MySql гораздо проще в использовании и менее требовательна к ресурсам (по сравнению с MongoDB).
        Ниже — описание, когда и что использовать.
        Когда и какие базы данных использовать?
        MySql — это однопользовательская система управления базами данных.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-06-06 15:27:00', '1', 'ACCEPTED', '2', '1', '45', 'Как я провёл лето',
        'Как я провёл лето, или про то, как не потерять деньги и здоровье на работе по найму.
        Как вы уже, наверное, знаете, во время моего недавнего пребывания в офисе на Васильевском острове, я успел провести несколько мастер-классов.
        В частности, в воскресенье 18 августа мне удалось пообщаться со слушателями по поводу того, как можно потерять здоровье и деньги на работе.
        И поскольку я сам на протяжении последних нескольких лет периодически сижу без зарплаты, то этот рассказ будет полезным многим людям.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-06-03 17:12:00', '1', 'NEW', NULL, '1', '0', 'Как мы работали удалённо во время пандемии в IT сфере',
        'Сейчас очень многие сферы деятельности стали удалёнными.
        И мы не стали исключением.
        Мы уже 10 лет занимаемся продвижением в интернете проектов в сфере IT и интернет-маркетинга.
        В условиях карантина, когда большинство людей сидит дома, мы продолжаем свою работу.
        Так как наш офис находится в Киеве, то и большинство наших клиентов тоже находятся в Украине.
        Но это не мешает нам работать и зарабатывать деньги даже во время карантина.
        Продуктивность упала, но мы смогли это пережить!');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-06-15 19:22:00', '1', 'ACCEPTED', '2', '1', '15', 'Программистам нужен отдых ',
        'По данным исследования компании Gartner, рынок труда программистов в России, как и во всем мире, переживает не лучшие времена.
        Компании сокращают свои штаты или вовсе планируют закрыть некоторые подразделения, а многие работники покидают отрасль.
        Такие неутешительные прогнозы для российского рынка труда не в новинку.
        Однако это не единственные проблемы, с которыми сталкивается отрасль информационных технологий.
        Нехватка программистов, по оценкам специалистов, составляет около 5 000 человек.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2020-01-11 17:22:00', '1', 'DECLINED', '3', '1', '0', 'Сегодня я первый раз выпил энергетик',
        'В том плане что пил его в первый раз в жизни.
        Раньше я как то не воспринимал его всерьёз, но после того как я узнал что этот энергетик - напиток для спортсменов, я стал пить его намного чаще.
        По моему мнению, энергетики - это очень хорошая вещь, особенно на случай если тебе нужно быстро прийти в себя или взбодриться.
        Не всегда под рукой есть кофе или чай, а быть бодрым нужно.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2019-02-12 15:01:00', '1', 'DECLINED', '2', '4', '0', 'Как я делал блог на Java', 'Я делаю блог в Java, и я не уверен, что я делаю что-то неправильно.
У меня есть приложение, которое я использую для блога, а также, если я захочу сделать блог, то я буду использовать это приложение.
Для этого требуется php файл для каждой страницы, поэтому, когда я нажимаю кнопку, мне нужно проверить, работает ли он, и если нет, то нужно добавить php-файл.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2019-02-12 11:50:00', '1', 'ACCEPTED', NULL, '3', '0','Почему я стал писать на Java',
        'Я начал писать на Java в 2005 году, с тех пор прошло уже 12 лет.
        Тогда я был начинающим разработчиком и изучал Java SE, но сейчас, оглядываясь назад, понимаю, что это была не самая лучшая идея.
        Вместо этого я поступил на магистерскую программу MIT в области компьютерных наук и стал изучать Python, C, C++ и другие вещи.
        После этого я понял, как много можно сделать, зная язык программирования, о котором ничего не знаешь.
        В то время существовало великое множество языков.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2019-02-12 09:01:00', '1', 'NEW', NULL, '3', '0', 'Как я устраивался программистом в Яндекс',
        'Привет, хабралюди!
        Несколько лет назад я решил заняться программированием.
        У меня к этому был талант — мой дедушка программист.
        Начал я с HTML и CSS, а затем перешел к PHP и Python.
        А после PHP я стал изучать JS, чтобы писать мобильные приложения для Android.
        И вот через год я получил работу в одной из крупнейших IT-компаний в России.
        На собеседовании мне задали вопрос: “С какими языками программирования ты знаком?”.
        Я ответил: “HTML, CSS, Javascript, PHP, Python”.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2019-11-25 12:01:00', '1', 'NEW', NULL, '4', '0', 'Плюсы python',
        'Вы можете использовать его как обычный код javascript, и он будет работать на обычном веб-сервере (и на любом другом, который вы можете запустить).
        Вы можете использовать большинство из тех же библиотек, что и JavaScript, которые могут быть очень полезными для написания сценариев, похожих на Javascript.
        В дополнение к этому Python поддерживает встроенный язык разметки документа.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2020-11-11 22:11:00', '1', 'ACCEPTED', NULL, 1, '0', 'Vue.js что это и с чем едят?',
        'Vue.js - это фреймворк JavaScript, предназначенный для создания веб-приложений с использованием методов объектно-ориентированного программирования.
        В этом уроке вы получите общее представление о том, что такое Vue.
        Узнаете о возможности подключения компонентов, их использовании и управлении ими.
        С помощью этого урока вы сможете создавать собственные приложения используя этот фреймворк.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-08-04 13:25:00', '1', 'ACCEPTED', '2', 1, '40', 'Как работают программисты',
        'В этом году я начал работать в одной из московских IT-компаний.
        Я пришел туда совсем еще начинающим сотрудником.
        Сначала мне поручили вести один небольшой проект.
        По большому счету, я занимался всем: составлял и согласовывал ТЗ, искал исполнителей, договаривался с партнерами о том, чтобы они принимали участие.
        Умел не только согласовывать ТЗ, но и самостоятельно его составлять.
        Помню, как однажды мы готовили техническое задание для интернет-магазина и я сам себе его написал.');
