INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-06-03 15:11:00', '1', 'ACCEPTED', '2', '3', '2', 'Java блог для начинающих', 'Java блог для начинающих Создать блог на javablog.
Блог на Java за 10 минут. Java для начинающих. Часть 2. Часть 1 Хабр. Как создать свой собственный онлайн блог на Java.
Создание блога на C#: подробное руководство по созданию. drofa. Juno. Блоги на Java: как создавать и управлять ими. Blogspot.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-06-06 15:27:00', '1', 'ACCEPTED', '2', '1', '30', 'Как я провёл лето', 'Как я провёл лето, или про то, как не потерять деньги и здоровье на работе по найму
Как вы уже, наверное, знаете, во время моего недавнего пребывания в офисе на Васильевском острове, я успел провести несколько мастер-классов.
В частности, в воскресенье 18 августа мне удалось пообщаться со слушателями по поводу того, как можно потерять здоровье и деньги на работе.
И поскольку я сам на протяжении последних нескольких лет периодически сижу без зарплаты, то этот рассказ будет полезным многим людям.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-06-03 15:12:00', '1', 'NEW', NULL, '3', '3', 'Короновирус добрался и до нашего города',
        'Не стала исключением и наша больница, где в целях профилактики и избежания заражения персонала и пациентов, было решено ограничить посещение больных и перевести большую часть пациентов на дистанционное лечение.
        Сегодня, к примеру, у нас уже 7 пациентов с подтвержденным диагнозом "Короновирус", ещё несколько человек с подозрением на этот же диагноз.
        В ближайшее время ждем новых пациентов с подозрением.
        Все они находятся в боксе, на карантине.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2021-06-15 11:01:00', '1', 'ACCEPTED', '2', '1', '15', 'История про велосипед', 'Ну, где он, этот чудо-велосипед?» — задавалась вопросом моя подруга после очередной попытки покататься в парке.
В итоге в один прекрасный день, когда мы стояли в очереди за мороженым, она рассказала мне эту историю.
Показать полностью...
Далее от ее лица: «Сегодня с утра я решила поехать по делам на велосипеде.
Ехать нужно было в другой район города, поэтому пришлось встать часов в 6, что бы не опоздать и ехать не спеша.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2020-01-11 11:01:00', '1', 'ACCEPTED', '2', '1', '15', 'Сегодня я первый раз выпил энергетик', 'В том плане что пил его в первый раз в жизни.
Раньше я как то не воспринимал его всерьёз, но после того как я узнал что этот энергетик - напиток для спортсменов, я стал пить его намного чаще.
По моему мнению, энергетики - это очень хорошая вещь, особенно на случай если тебе нужно быстро прийти в себя или взбодриться.
Не всегда под рукой есть кофе или чай, а быть бодрым нужно.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2019-02-12 11:01:00', '1', 'ACCEPTED', '2', '3', '0', 'Как я делал блог на Java', 'Я делаю блог в Java, и я не уверен, что я делаю что-то неправильно.
У меня есть приложение, которое я использую для блога, а также, если я захочу сделать блог, то я буду использовать это приложение.
Для этого требуется php файл для каждой страницы, поэтому, когда я нажимаю кнопку, мне нужно проверить, работает ли он, и если нет, то нужно добавить php-файл.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2019-02-12 11:01:00', '0', 'NEW', NULL, '3', '0', 'Java самый лучший язык программирования с точки зрения удобства использования?',
'Я прочитал много статей, но все их мнения разделяются.
Некоторые говорят, что Java - это самый лучший язык, другие наоборот.
Теперь мне интересны ваши обоснованные мнения (особенно если вы когда-либо пользовались Java
Это зависит от ваших потребностей.
Вам не нужно делать все, что вы можете написать на C, и поэтому C и C++ не могут быть вашим выбором.
Они не имеют тех же преимуществ, которые есть у Objective C и Swift.');

INSERT INTO posts (time, is_active, moderation_status, moderator_id, user_id, view_count, title, text)
VALUES ('2019-02-12 11:01:00', '0', 'DECLINED', '2', '3', '0', 'Как делал магазин на java и что мне это дало?', 'В общем, я хочу сделать магазин на java, который будет иметь доступ к базе данных mysql.
Может ли кто-нибудь помочь мне понять, как это сделать?
Заранее спасибо
Нет, Java не может использовать базу данных mysql для ваших нужд.
Это просто для базы данных в первую очередь.
Вам нужно убедиться, что ваши пользователи могут получить доступ и изменить содержимое вашей базы данных, иначе ваш магазин просто выйдет из строя при попытке его использования.');